; domain
(define (domain spanner)                    
(:requirements :typing :strips)                
(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
(define (problem p-s8-n8-l5-seed5)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 spanner8 - spanner
     nut1 nut2 nut3 nut4 nut5 nut6 nut7 nut8 - nut
     location1 location2 location3 location4 location5 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location5)
    (useable spanner1)
    (at spanner2 location3)
    (useable spanner2)
    (at spanner3 location3)
    (useable spanner3)
    (at spanner4 location5)
    (useable spanner4)
    (at spanner5 location1)
    (useable spanner5)
    (at spanner6 location4)
    (useable spanner6)
    (at spanner7 location2)
    (useable spanner7)
    (at spanner8 location1)
    (useable spanner8)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (loose nut5)
    (at nut5 gate)
    (loose nut6)
    (at nut6 gate)
    (loose nut7)
    (at nut7 gate)
    (loose nut8)
    (at nut8 gate)
    (link shed location1)
    (link location5 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
   (tightened nut5)
   (tightened nut6)
   (tightened nut7)
   (tightened nut8)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 8
2. (pickup_spanner location1 spanner8 bob)
   deleted: (at spanner8 location1)
   added: (carrying bob spanner8)
   goals met: 0 of 8
3. (pickup_spanner location1 spanner5 bob)
   deleted: (at spanner5 location1)
   added: (carrying bob spanner5)
   goals met: 0 of 8
4. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 8
5. (pickup_spanner location2 spanner7 bob)
   deleted: (at spanner7 location2)
   added: (carrying bob spanner7)
   goals met: 0 of 8
6. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 8
7. (pickup_spanner location3 spanner3 bob)
   deleted: (at spanner3 location3)
   added: (carrying bob spanner3)
   goals met: 0 of 8
8. (pickup_spanner location3 spanner2 bob)
   deleted: (at spanner2 location3)
   added: (carrying bob spanner2)
   goals met: 0 of 8
9. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 8
10. (pickup_spanner location4 spanner6 bob)
   deleted: (at spanner6 location4)
   added: (carrying bob spanner6)
   goals met: 0 of 8
11. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 8
12. (pickup_spanner location5 spanner4 bob)
   deleted: (at spanner4 location5)
   added: (carrying bob spanner4)
   goals met: 0 of 8
13. (pickup_spanner location5 spanner1 bob)
   deleted: (at spanner1 location5)
   added: (carrying bob spanner1)
   goals met: 0 of 8
14. (walk location5 gate bob)
   deleted: (at bob location5)
   added: (at bob gate)
   goals met: 0 of 8
15. (tighten_nut gate spanner8 bob nut1)
   deleted: (loose nut1) (useable spanner8)
   added: (tightened nut1)
   goals met: 1 of 8
16. (tighten_nut gate spanner7 bob nut2)
   deleted: (loose nut2) (useable spanner7)
   added: (tightened nut2)
   goals met: 2 of 8
17. (tighten_nut gate spanner6 bob nut3)
   deleted: (loose nut3) (useable spanner6)
   added: (tightened nut3)
   goals met: 3 of 8
18. (tighten_nut gate spanner5 bob nut4)
   deleted: (loose nut4) (useable spanner5)
   added: (tightened nut4)
   goals met: 4 of 8
19. (tighten_nut gate spanner4 bob nut5)
   deleted: (loose nut5) (useable spanner4)
   added: (tightened nut5)
   goals met: 5 of 8
20. (tighten_nut gate spanner3 bob nut6)
   deleted: (loose nut6) (useable spanner3)
   added: (tightened nut6)
   goals met: 6 of 8
21. (tighten_nut gate spanner2 bob nut7)
   deleted: (loose nut7) (useable spanner2)
   added: (tightened nut7)
   goals met: 7 of 8
22. (tighten_nut gate spanner1 bob nut8)
   deleted: (loose nut8) (useable spanner1)
   added: (tightened nut8)
   goals met: 8 of 8
